001_Конспекты_курсов_2/src/Catalogs/Ленты/Ленты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Ленты</name>
  <attributes>
    <name>ОсновнойТекст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Комментарии</name>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Картинка</name>
      <type>
        <types>CatalogRef.ЛентыФайлы</types>
      </type>
    </attributes>
    <attributes>
      <name>Тэг</name>
      <type>
        <types>CatalogRef.Тэги</types>
      </type>
    </attributes>
    <attributes>
      <name>Ширина</name>
      <comment>width</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Высота</name>
      <comment>height</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Якорь</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

001_Конспекты_курсов_2/src/Catalogs/Ленты/Forms/ФормаВводаТекста/Module.bsl
#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если ЗначениеЗаполнено(ВведенныйТекст) Тогда
		СтруктураПараметров = Новый Структура("ВведенныйТекст, Тэг, НомерСтроки, Якорь", ВведенныйТекст, Тег, НомерСтроки, Якорь);
		ОповеститьОВыборе(СтруктураПараметров);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Комментарий") Тогда
		ВведенныйТекст = Параметры.Комментарий;
	КонецЕсли;

	Если Параметры.Свойство("Тэг") Тогда
		Тег = Параметры.Тэг;
	КонецЕсли;
	
	Если Параметры.Свойство("НомерСтроки") Тогда
		НомерСтроки = Параметры.НомерСтроки;
	КонецЕсли;

	Если Параметры.Свойство("Якорь") Тогда
		НомерСтроки = Параметры.Якорь; //
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
